{
  "entries": [
    {
      "title": "Build Day 1",
      "content": "This was our first build day for the 2025-2026 season, and we spent the day laying the foundation for the robot’s basic structure. The first priority was the drivetrain, which we decided to construct using a 6-wheel drive train powered by six motors. This configuration gives us both speed and power, and it should be well-suited for handling the competition's dynamic gameplay.\r\n\r\nHowever, during the assembly, we ran into an issue with the drivetrain alignment. The motors weren't properly aligned, which caused some uneven power distribution and made the robot move erratically. After re-calibrating the motor placement and adjusting the frame’s support structure, we were able to fix the alignment issue. The drivetrain now runs smoothly and is ready for further refinement.",
      "category": "building",
      "codeSnippet": null,
      "codeLanguage": null,
      "imageUrls": [
        "./uploads/files-1761452681222-936143816.jpg"
      ],
      "audioUrls": [],
      "videoUrls": [],
      "id": 18,
      "createdAt": "2025-10-26T04:24:42.362Z",
      "updatedAt": "2025-11-04T05:18:35.501Z"
    },
    {
      "title": "Build Day 2",
      "content": "Today, we made significant progress with the intake system, addressing several issues from the previous week. The main challenge was that the blocks were not entering the intake smoothly due to poor funneling at the front of the robot. To fix this, we reconfigured the C-channels to form a more aggressive angle, which helped direct the blocks toward the intake rollers. Additionally, we added an S-shaped structure on top of the robot to improve the overall funneling and block guidance system.\r\n\r\nWhile these changes helped, we did notice that some blocks still had trouble getting fully into the intake, especially under fast movement. We plan to continue adjusting the angle and speed of the intake mechanism to ensure that it works reliably under all conditions.",
      "category": "building",
      "codeSnippet": null,
      "codeLanguage": null,
      "imageUrls": [],
      "audioUrls": [],
      "videoUrls": [],
      "id": 19,
      "createdAt": "2025-10-26T04:26:55.522Z",
      "updatedAt": "2025-11-04T05:21:44.002Z"
    },
    {
      "title": "Build Day 3",
      "content": "We continued work on the intake system today, focusing on eliminating the friction that had been causing problems in previous tests. We reworked the internal gear mechanisms to ensure smoother operation and reduced the strain on the motors. After completing this adjustment, we performed several tests with different block types and found that the intake was now able to consistently collect and transport blocks into the robot without any issues.\r\n\r\nWe also began testing the robot’s autonomous movement. The autonomous program was still in the early stages, but we were able to test basic movements like forward motion and turns. However, we noticed that the robot had trouble turning sharply, especially under load. We suspect that the turning radius may need to be further reduced to improve accuracy, so the next step will be recalibrating the turning motors to allow for better precision.",
      "category": "building",
      "codeSnippet": null,
      "codeLanguage": null,
      "imageUrls": [],
      "audioUrls": [],
      "videoUrls": [],
      "id": 20,
      "createdAt": "2025-10-26T04:27:55.464Z",
      "updatedAt": "2025-11-04T05:23:37.710Z"
    },
    {
      "title": "Build Day 4",
      "content": "Today, we focused on addressing the intake friction that had been affecting block collection. In previous tests, the intake rollers were too tight, which caused unnecessary friction and prevented smooth block intake. Our first iteration involved loosening the rollers slightly, but this didn’t fully solve the problem.\r\n\r\nFailed Solutions and Iterations:\r\nIn an effort to reduce friction, we tried increasing the motor power. However, this only caused more inconsistencies, with some blocks getting stuck while others were ejected too forcefully.\r\n\r\nSolution Brainstorming:\r\nAfter discussing the issue with the team, we decided to test the spacing between the intake rollers and experimented with different materials to reduce friction. We replaced the rollers with a smoother plastic compound, which provided less resistance while maintaining grip on the blocks.\r\n\r\nFinal Solution:\r\nOnce the new rollers were installed, we tested the system and observed a significant reduction in friction, leading to smoother block collection and fewer jams. This solution has been successful in all subsequent tests, and we are now confident in the intake system’s performance.",
      "category": "building",
      "codeSnippet": null,
      "codeLanguage": null,
      "imageUrls": [],
      "audioUrls": [],
      "videoUrls": [],
      "id": 21,
      "createdAt": "2025-10-26T04:28:30.097Z",
      "updatedAt": "2025-11-04T05:24:38.658Z"
    },
    {
      "title": "Build Day 5",
      "content": "We continued work on the arm system, which had been an ongoing challenge. Initially, the arms were too long and caused significant interference with the high goal. In previous tests, the arms would get stuck or miss the target entirely. We brainstormed various solutions, including shortening the arms or modifying their angle, but early attempts to adjust the arms were unsuccessful.\r\n\r\nBrainstorming and Iteration Process:\r\nOur first solution involved simply shortening the arms by 2 inches, but this only partially solved the problem. The arms still interfered with the goal structure at certain angles. After revisiting the design, we realized that the arm’s angle needed to be adjusted as well, not just the length. By modifying the angle at which the arms extended, we were able to prevent them from catching on the goal structure while still allowing them to push blocks through the high goal.\r\n\r\nFinal Solution:\r\nThe new arm length and angle combination has greatly improved the performance of the high-goal shot. The arms now function smoothly, pushing the blocks directly through the goal without interference. Further testing confirmed that this solution worked across a range of match scenarios, and we have now integrated it into our final design.",
      "category": "building",
      "codeSnippet": null,
      "codeLanguage": null,
      "imageUrls": [
        "./uploads/files-1761452998156-621794287.png"
      ],
      "audioUrls": [],
      "videoUrls": [],
      "id": 22,
      "createdAt": "2025-10-26T04:29:14.456Z",
      "updatedAt": "2025-11-04T05:26:08.481Z"
    },
    {
      "title": "Build Day 6",
      "content": "Today’s session was focused on finalizing the intake system and improving the robot’s stability, which had been issues in previous tests. We found that the alignment of the intake rollers was causing friction, leading to inconsistent block collection. After reviewing the issue, we attempted to fix it by adjusting the roller spacing, but the results were still unsatisfactory.\r\n\r\nFailed Solutions and Iteration Process:\r\nInitially, we tried adjusting the roller motor speed, hoping that a faster speed would compensate for the friction. This approach, however, only made the problem worse, as the increased motor speed caused the intake system to miss blocks entirely or eject them too quickly.\r\n\r\nSolution Brainstorming:\r\nAfter discussing with the team, we decided that the problem wasn’t with the motor speed, but with the roller alignment itself. We tested a few different roller configurations, and eventually, we came up with the idea to reposition the rollers to a more vertical angle. This would ensure that the blocks were fed directly into the intake without any lateral movement that could cause jams.\r\n\r\nFinal Solution:\r\nOnce the rollers were repositioned and realigned, we re-tested the system. This modification solved the friction issue and allowed the intake system to perform consistently. The intake is now able to smoothly collect blocks and deliver them to the robot’s storage system with high reliability.\r\n\r\nAdditionally, we worked on rebalancing the robot’s weight distribution, as it had previously been causing instability during sharp turns. After trying several configurations, we determined that the optimal solution was to relocate the brain to a more central position, improving balance and allowing for tighter turns. This change has made the robot much more stable during high-speed maneuvers.\r\n\r\nTesting and Optimization:\r\nWe performed several test runs with the new configurations and observed significant improvements in both the intake system and the robot’s overall performance. The robot now handles both high-speed turns and block collection more efficiently, and the stability improvements have given us more confidence in our design.",
      "category": "building",
      "codeSnippet": null,
      "codeLanguage": null,
      "imageUrls": [],
      "audioUrls": [],
      "videoUrls": [],
      "id": 23,
      "createdAt": "2025-11-04T01:19:38.957Z",
      "updatedAt": "2025-11-04T05:27:04.828Z"
    },
    {
      "title": "Pictures from 11/01/25",
      "content": "Important parts of the bot and the storage amounts in the robot.",
      "category": "design",
      "codeSnippet": null,
      "codeLanguage": null,
      "imageUrls": [
        "./uploads/files-1762219306864-615302487.jpg",
        "./uploads/files-1762219355973-371396332.jpg"
      ],
      "audioUrls": [],
      "videoUrls": [],
      "id": 24,
      "createdAt": "2025-11-04T01:21:47.071Z",
      "updatedAt": "2025-11-04T20:57:04.818Z"
    },
    {
      "title": "Autonomous Notes (11/01/25)",
      "content": "32.5 in going forward from starting position\r\n27.5 going back from the match loader\r\nGoing back a certain amount then turning 135 degreees\r\nMove forward 32 while intaking\r\nMove foreward 17.5\r\nRight hand side auton\r\nLeft hand side auton:\r\nturn 180 degrees\r\nMove foreward 14.75\r\nMirror other measurements from the right side",
      "category": "code",
      "codeSnippet": null,
      "codeLanguage": null,
      "imageUrls": [],
      "audioUrls": [],
      "videoUrls": [],
      "id": 25,
      "createdAt": "2025-11-04T01:24:21.811Z",
      "updatedAt": "2025-11-04T01:24:48.179Z"
    },
    {
      "title": "Main Game Plan for Cornfeild",
      "content": "The main strength of our bot, currently, is our drive/intake, so we want to ensure it is as refined as possible. We will have plenty of opportunities for our driver to get comfortable with the controls, as well as allowing coders to tweak the controls. Our plan is a bit simple, as it is just to get a lot of blocks and score in the high goals.",
      "category": "gameplan",
      "codeSnippet": null,
      "codeLanguage": null,
      "imageUrls": [],
      "audioUrls": [],
      "videoUrls": [],
      "id": 26,
      "createdAt": "2025-11-04T01:26:27.468Z",
      "updatedAt": "2025-11-04T05:01:05.599Z"
    },
    {
      "title": "Build Day 7",
      "content": "Today was crucial in finalizing the major design issues that had plagued us earlier in the build process. One of the most prominent challenges we faced was with the robot’s hood mechanism, which was not tight enough to guarantee consistent block throughput. Early tests showed that blocks would often get stuck or not pass through the system properly.\r\n\r\nInitial Problem and Iterations:\r\nIn our first iteration, we attempted to resolve the issue by tightening the zip ties that held the hood in place. However, this did not provide the necessary stability, and the blocks still didn’t pass through consistently. Our second iteration involved using a smaller number of larger zip ties, but this only addressed part of the problem. The blocks would sometimes pass through, but the trajectory wasn’t consistent, and occasionally the blocks would get stuck on the edges of the hood.\r\n\r\nBrainstorming Solutions:\r\nAfter reviewing the problem with the team, we brainstormed alternative solutions, including using different types of materials to make the hood more rigid. We also considered redesigning the hood mechanism entirely but realized that this would be too time-consuming given our competition timeline.\r\n\r\nFinal Solution:\r\nUltimately, we decided to rework the zip tie configuration, increasing the number of ties and ensuring that they were distributed more evenly to create a more consistent pressure around the hood. This allowed the blocks to pass through more smoothly, and after a few additional adjustments, the throughput became much more reliable.\r\n\r\nIn addition to this, we completed work on the “lil will” mechanism, which had been problematic in previous iterations. The arm mechanism had consistently failed to push blocks through the high goal without jamming. The arms were initially too long, which caused them to get stuck on the sides of the goal. In our brainstorming sessions, we tested several lengths and angles for the arms, ultimately finding that shortening the arms by 1.5 inches solved the problem. The new arm length allowed for smoother motion and more accurate block positioning during goal scoring.\r\n\r\nTesting and Final Adjustments:\r\nAfter implementing these changes, we conducted a series of tests that demonstrated the improvements. blocks were consistently pushed through the high goal without any jamming, and the hood mechanism now functioned as expected. These adjustments are now considered final, and we can move forward with driver practice and fine-tuning the autonomous code.",
      "category": "building",
      "codeSnippet": null,
      "codeLanguage": null,
      "imageUrls": null,
      "audioUrls": null,
      "videoUrls": null,
      "id": 28,
      "createdAt": "2025-11-04T05:29:15.099Z",
      "updatedAt": "2025-11-04T05:29:15.099Z"
    },
    {
      "title": "Build Day 8",
      "content": "Following extensive testing of our autonomous routine, we encountered delays with block retrieval, as the intake system wasn’t fast enough to collect the required number of blocks within the time limit. To address this, we initially increased the intake motor speed, which allowed for faster block collection. However, this introduced a new problem: the robot became unstable during high-speed movements, especially when turning or transitioning between tasks, making it difficult to maintain control.\r\n\r\nTo resolve this, we brainstormed several solutions, including adjusting weight distribution and modifying the intake design, but these didn’t provide the balance we needed. After further testing, we focused on fine-tuning both the intake and drive systems. We gradually increased the intake motor speed to avoid overdriving the system and recalibrated the robot’s drive path to smooth out transitions between collection zones. This allowed us to maintain control while still speeding up block collection.\r\n\r\nWe’re now testing adaptive motor controls, where the intake speed adjusts dynamically based on the robot’s position and the number of blocks collected. This has shown promising results, allowing for faster collection when conditions are stable and slowing down when more precision is needed. We’re continuing to refine this balance, with more testing planned to ensure the robot remains stable under varying conditions and can collect blocks efficiently without compromising control.",
      "category": "design",
      "codeSnippet": null,
      "codeLanguage": null,
      "imageUrls": null,
      "audioUrls": null,
      "videoUrls": null,
      "id": 29,
      "createdAt": "2025-11-04T05:32:31.437Z",
      "updatedAt": "2025-11-04T05:32:31.437Z"
    },
    {
      "title": "Code Autons PT1- Pickaing the Language and Setting Up",
      "content": "When we started coding our autons for Pushback 25–26, we decided to go with C++ using PROS. We already liked how flexible PROS is, especially with the EZ-Template library, and it lets us use real programming structures like classes, enums, and functions. That makes the code more modular and cleaner than just using VEXcode blocks or simplified scripts.\r\n\r\nWe built a custom Sprockets class to handle all the motors that control intaking and scoring. Inside the class, we defined four motors, one for intake and three for the sprockets that move the blocks through the system. We also made an enum called State, which lists out all the scoring modes like INTAKE, LOW_GOAL, MIDDLE_GOAL, and HIGH_GOAL. This made it easier to write one piece of logic that changes behavior depending on the mode instead of having separate functions for each.\r\n\r\nWe set different brake modes in the constructor to control how each motor stops. The intake uses HOLD mode so it stays in place when not moving, while the rest use COAST so they don’t jerk to a stop. That small setup change actually made scoring smoother and stopped the blocks from bouncing backward.",
      "category": "code",
      "codeSnippet": null,
      "codeLanguage": null,
      "imageUrls": [],
      "audioUrls": [],
      "videoUrls": [],
      "id": 30,
      "createdAt": "2025-11-04T16:25:44.797Z",
      "updatedAt": "2025-11-04T16:26:06.223Z"
    },
    {
      "title": "Code Autons PT2- Writing and Tuning the Movement Code",
      "content": "The main logic for how the sprockets behave is inside the move() function. We used a switch (state) statement that runs different sets of motor commands based on what mode the robot is in. Each state has its own motor directions and speeds.\r\n\r\nFor example, in the HIGH_GOAL state, the intake reverses to push blocks out, while the other sprockets alternate directions to feed them upward through the system. We used positive and negative voltages (±127) to control direction — PROS uses full voltage values instead of percent, which gives us consistent power.\r\nIn INTAKE mode, we lowered the power of the middle motor by dividing the voltage by 3 (-SPROCKET_VOLTAGE / 3). That slowed the center sprocket so blocks don’t jam when they first enter the mechanism.\r\n\r\nWe also added a default case in the switch that brakes all motors. This means if the state is NONE or something unexpected happens, the whole system stops safely. That helps prevent overheating and random movement when switching modes.",
      "category": "code",
      "codeSnippet": null,
      "codeLanguage": null,
      "imageUrls": null,
      "audioUrls": null,
      "videoUrls": null,
      "id": 31,
      "createdAt": "2025-11-04T16:26:28.482Z",
      "updatedAt": "2025-11-04T16:26:28.482Z"
    },
    {
      "title": "Code Autons PT3- Connecting It to Controls and Auton ",
      "content": "Once the logic worked, we wrote the opcontrol() function to link the sprocket states to controller buttons.\r\n\r\nL1 triggers HIGH_GOAL,\r\n\r\nL2 triggers MIDDLE_GOAL,\r\n\r\nR1 runs INTAKE,\r\n\r\nR2 runs LOW_GOAL,\r\nand if nothing is pressed, the state defaults to NONE.\r\n\r\nThis setup let us test each function manually before we added it into autonomous routines. Inside opcontrol(), we use set_state() to update the mode and then call move() so the motors react right away. We also wrote another helper function called set_state_and_move(), which combines both actions into one call — that’s what we’ll use in auton since it’s shorter and cleaner.\r\n\r\nWhen we started coding the autonomous routines, we just had to call things like sprockets.set_state_and_move(Sprockets::State::LOW_GOAL); instead of writing four separate motor commands. This made it way easier to chain together tasks like intake → score → stop. It also keeps the auton code simple and readable, which helps when debugging or tuning between matches.",
      "category": "design",
      "codeSnippet": null,
      "codeLanguage": null,
      "imageUrls": null,
      "audioUrls": null,
      "videoUrls": null,
      "id": 32,
      "createdAt": "2025-11-04T16:27:13.320Z",
      "updatedAt": "2025-11-04T16:27:13.320Z"
    },
    {
      "title": "Entry #1: Early Design and Concept",
      "content": "When we started building this robot for the Pushback 25–26 season, our main goal was to make a compact but strong bot that could handle blocks consistently and not jam up. We wanted a clean intake system that could quickly grab blocks from the floor and feed them up into the scoring hood. The base design used a wide intake roller setup with a metal hood on top that guides the block smoothly out when scoring. The original hood was made of black polycarbonate, but we replaced it with metal mesh later for better airflow and less friction. That change made a noticeable difference — the blocks came out faster and with more power.\r\n\r\nWe focused on keeping the center of gravity low, so the robot wouldn’t tip when pushing blocks or scoring from a distance. Most of the heavy parts like motors and the brain sit low on the chassis, and the structure above is lighter. The drivetrain uses traction and omni wheels for balance between pushing power and turning control. We kept the frame open in the front for smoother intake and easier servicing during competition.",
      "category": "design",
      "codeSnippet": null,
      "codeLanguage": null,
      "imageUrls": null,
      "audioUrls": null,
      "videoUrls": null,
      "id": 33,
      "createdAt": "2025-11-04T16:51:32.410Z",
      "updatedAt": "2025-11-04T16:51:32.410Z"
    },
    {
      "title": "Entry #2: Hood Mechanism and Power Adjustments",
      "content": "The hood mechanism went through a few redesigns. We realized that when the hood was fixed, the blocks sometimes didn’t launch cleanly, they’d either stall or bounce out weakly. So, we redesigned the hood to move freely up and down using metal mesh and a pivot system. This lets it naturally lift when the block is shot out, reducing resistance and increasing power. It’s a simple but really effective fix that we came up with after watching other teams at the Mall of America competition.\r\n\r\nSeeing other robots there gave us ideas about tuning flexibility. We noticed top teams used adjustable or flexible launch angles, so our hood redesign followed that idea. We also added polycarbonate guards to help guide the block straighter into the middle of the hood. After testing, we saw a big boost in consistency: less stalling, more accurate shots.",
      "category": "design",
      "codeSnippet": null,
      "codeLanguage": null,
      "imageUrls": null,
      "audioUrls": null,
      "videoUrls": null,
      "id": 34,
      "createdAt": "2025-11-04T17:02:21.351Z",
      "updatedAt": "2025-11-04T17:02:21.351Z"
    },
    {
      "title": "Entry #1: Functionality and Adjustments",
      "content": "When we ran our first tests, the intake worked well but the middle sprocket was spinning too fast, which sometimes caused jams. We adjusted the code to lower that motor’s speed (/3 voltage reduction) so it fed blocks more smoothly into the upper stages. Once that was fixed, scoring became a lot more reliable.\r\n\r\nWe also ran drive and scoring drills to see how the robot performed under match pressure. The robot handled pushing well and didn’t tip even with full speed turns. The mesh hood system really proved itself during tests — the shots came out faster and cleaner compared to our old design.",
      "category": "testing",
      "codeSnippet": null,
      "codeLanguage": null,
      "imageUrls": null,
      "audioUrls": null,
      "videoUrls": null,
      "id": 35,
      "createdAt": "2025-11-04T17:03:26.467Z",
      "updatedAt": "2025-11-04T17:03:26.467Z"
    },
    {
      "title": "Entry #2: Match Simulation and Stress Testing",
      "content": "We did several simulated match runs where we practiced picking up, scoring, and defending. The drivetrain had great pushing power, but we had to strengthen a few braces after some rough collisions — the back section flexed a little too much under load. After reinforcing it with crossbars, it felt solid.\r\n\r\nThe biggest test improvement came from timing the intake and hood actions. Once we matched the intake speed with the sprocket timing, blocks moved through perfectly without backing up. We kept logging voltage values and run times until everything synced up smoothly.",
      "category": "testing",
      "codeSnippet": null,
      "codeLanguage": null,
      "imageUrls": null,
      "audioUrls": null,
      "videoUrls": null,
      "id": 36,
      "createdAt": "2025-11-04T17:04:08.728Z",
      "updatedAt": "2025-11-04T17:04:08.728Z"
    },
    {
      "title": "Entry #1: Brainstorm and Planning",
      "content": "During our early team meetings, we talked a lot about what kind of robot we wanted for Pushback — whether to focus on scoring or pushing power. We agreed that the best design would be a mix of both: strong in defense but still able to score fast when we had the chance. That’s what pushed us toward the multi-sprocket intake design with a flexible hood.\r\n\r\nWe split tasks so one person focused on coding (mostly the Sprockets class and auton tuning), another on wiring and structure, and others on fine-tuning the hood geometry. We also planned out how to organize our autons using EZ-Template, since it makes switching between different strategies easier.",
      "category": "meeting",
      "codeSnippet": null,
      "codeLanguage": null,
      "imageUrls": null,
      "audioUrls": null,
      "videoUrls": null,
      "id": 37,
      "createdAt": "2025-11-04T17:04:30.667Z",
      "updatedAt": "2025-11-04T17:04:30.667Z"
    },
    {
      "title": "Entry #2: After Mall of America Competition",
      "content": "After competing at the Mall of America event, our whole view of robot design changed a bit. We saw teams with faster hoods and smoother scoring systems — a few even used flexible or weighted tops that automatically adjusted their launch power. That inspired our move from the solid black hood to the current metal mesh hood that moves freely.\r\n\r\nWe also noticed a lot of teams running clean cable management and more compact wiring, so we reorganized our setup to make maintenance faster. Overall, that event gave us a clearer sense of what separates a good bot from a great one: reliability, clean design, and easy access for repairs. We came home motivated to rebuild and make ours more consistent and modular.",
      "category": "meeting",
      "codeSnippet": null,
      "codeLanguage": null,
      "imageUrls": null,
      "audioUrls": null,
      "videoUrls": null,
      "id": 38,
      "createdAt": "2025-11-04T17:04:50.389Z",
      "updatedAt": "2025-11-04T17:04:50.389Z"
    },
    {
      "title": "Game Plan & Strategy – Entry #1: Overall Match Strategy",
      "content": "Our match plan is built around control, consistency, and quick scoring. The goal this season is to out-cycle and out-position our opponents instead of just brute forcing. Our robot is made to handle blocks smoothly, so we can intake, score, and reposition without wasting time lining up.\r\n\r\nAt the start of each match, we go for the center blocks right away. Our front intake pulls them in fast, then feeds them up through the sprocket system to the hood. With the new metal mesh hood that moves freely, the blocks come out stronger and with more speed, making it easier to hit the high and middle goals.\r\n\r\nDuring driver control, we focus on fast cycles — grabbing blocks, scoring, then immediately turning to collect more. The robot’s drivetrain has a good mix of traction and omni wheels, so we can move cleanly around other bots while still having enough pushing power to hold ground.\r\n\r\nWhen we play defense, the driver’s goal is to block angles and cut off opponents from lining up with the goal. We’ve practiced keeping the robot squared up and using short bursts instead of long pushes to stay in control. The main idea is to keep pressure up but not lose scoring chances.",
      "category": "gameplan",
      "codeSnippet": null,
      "codeLanguage": null,
      "imageUrls": null,
      "audioUrls": null,
      "videoUrls": null,
      "id": 39,
      "createdAt": "2025-11-04T17:06:32.785Z",
      "updatedAt": "2025-11-04T17:06:32.785Z"
    },
    {
      "title": "Game Plan & Strategy – Entry #2: Autonomous Strategy",
      "content": "Our autonomous plan is built for consistency first, then power. We have a few auton paths that each use the same Sprockets system from our main code, so everything behaves exactly the same as driver control. That makes tuning easier and avoids surprises during matches.\r\n\r\nHigh Goal Auton: Starts by running the intake to grab the nearest block, then switches the sprocket system into HIGH_GOAL mode to shoot it right away. After scoring, it drives forward to knock the center block onto our side, then backs off to reset.\r\n\r\nMiddle Goal Auton: Focuses on picking up one or two blocks and scoring them quickly in the middle goal for reliable points.\r\n\r\nLow Goal / Push Auton: Starts defensive — it drives forward to push extra blocks toward our side while blocking the opponent’s route.\r\n\r\nEach auton uses set_state_and_move() calls to activate different goal states. This lets us change scoring levels on the fly without needing separate code for each auton. We tuned each version for smooth feeding and no jams, and we’re currently working on better timing and distance tracking using EZ-Template’s pathing functions.",
      "category": "gameplan",
      "codeSnippet": null,
      "codeLanguage": null,
      "imageUrls": null,
      "audioUrls": null,
      "videoUrls": null,
      "id": 40,
      "createdAt": "2025-11-04T17:08:29.147Z",
      "updatedAt": "2025-11-04T17:08:29.147Z"
    },
    {
      "title": "Game Plan & Strategy – Entry #3: Driving Roles and Communication",
      "content": "We split driving into two main roles:\r\n\r\nThe main driver controls movement, positioning, and defense.\r\n\r\nThe co-driver runs the scoring system — intake, sprockets, and hood states.\r\n\r\nEach button on the controller sets a goal level (R1 for intake, R2 for low goal, L2 for middle goal, L1 for high goal). This setup keeps both drivers focused and allows quick reactions during matches.\r\n\r\nWe use short, clear callouts while driving — things like “ready,” “low,” “middle,” or “back up.” This keeps timing tight and avoids confusion. Between plays, the co-driver resets the sprockets back to NONE so the motors don’t burn out and the system stays ready for the next cycle.\r\n\r\nOur endgame plan is to spend the last 10 seconds either scoring low for guaranteed points or blocking the opposing robot to stop them from scoring high. We practiced quick turns and back pushes so we can close out the match strong and keep control till the end.",
      "category": "gameplan",
      "codeSnippet": null,
      "codeLanguage": null,
      "imageUrls": null,
      "audioUrls": null,
      "videoUrls": null,
      "id": 41,
      "createdAt": "2025-11-04T17:08:53.022Z",
      "updatedAt": "2025-11-04T17:08:53.022Z"
    }
  ],
  "users": [],
  "teamMembers": [],
  "sponsors": []
}